#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/kubernetes-ops-staging-10-vpc/runs/run-7Kjxbx5YmtyJ3q2i

Waiting for the plan to start...

Terraform v0.15.1
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0c098dac6f579d4b0]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0c9be23a5931cf294]
module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-097800a434f30e45a]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f123e331fb3c8115]
module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0]: Refreshing state... [id=vpc-cidr-assoc-0a3942801a35c45d3]
module.vpc.module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-05f3a437ea146bc35]
module.vpc.module.vpc.aws_subnet.elasticache[1]: Refreshing state... [id=subnet-04e3f95ed4da8de17]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-06328a7b84ef55f38]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-06f8be94f1c44ade2]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-069835afa658c927e]
module.vpc.module.vpc.aws_subnet.elasticache[2]: Refreshing state... [id=subnet-0e2482beb9ee577ff]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a60ba528563f06cb]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-063b2b878aba11564]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-08f49bacf42ea6217]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0c8e88db02c29e1f2]
module.vpc.module.vpc.aws_subnet.elasticache[0]: Refreshing state... [id=subnet-0657079e1cf654f83]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0a47ec6578cc0a02e]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0ba49e0d9b025cdb4]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0fc573779d8333634]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0225a5c1f1bbd0398]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0a97dcb3594985f7d]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0cf9f99235b96c3cf]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b499cac1fbabffce]
module.vpc.module.vpc.aws_route_table_association.elasticache[0]: Refreshing state... [id=rtbassoc-0b58d8e0561e25563]
module.vpc.module.vpc.aws_route_table_association.elasticache[1]: Refreshing state... [id=rtbassoc-073927233a1043b52]
module.vpc.module.vpc.aws_route_table_association.elasticache[2]: Refreshing state... [id=rtbassoc-0096c8c33d826c9b1]
module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0]: Refreshing state... [id=dev]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-090848b4c34deb6aa]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-07fc19912c0fabdeb]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-0352c383f46568586]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-06328a7b84ef55f381080289494]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-06e8057b4f8e433fa]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-085697243864effc5]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08c67d0f1a3946684]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-069835afa658c927e1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-06f8be94f1c44ade21080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-063b2b878aba115641080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "dev-us-east-1a"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all             = {
          + "Name"                 = "dev-us-east-1a"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "dev-us-east-1b"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all             = {
          + "Name"                 = "dev-us-east-1b"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"                 = "dev-us-east-1c"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all             = {
          + "Name"                 = "dev-us-east-1c"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc                  = true
    }

  # module.vpc.module.vpc.aws_elasticache_subnet_group.elasticache[0] will be created
  + resource "aws_elasticache_subnet_group" "elasticache" {
      + arn         = (known after apply)
      + description = "ElastiCache subnet group for dev"
      + id          = (known after apply)
      + name        = "dev"
      + subnet_ids  = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "dev-us-east-1a"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all             = {
          + "Name"                 = "dev-us-east-1a"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "dev-us-east-1b"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all             = {
          + "Name"                 = "dev-us-east-1b"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"                 = "dev-us-east-1c"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all             = {
          + "Name"                 = "dev-us-east-1c"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "dev-private-us-east-1a"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all         = {
          + "Name"                 = "dev-private-us-east-1a"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "dev-private-us-east-1b"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all         = {
          + "Name"                 = "dev-private-us-east-1b"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "dev-private-us-east-1c"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all         = {
          + "Name"                 = "dev-private-us-east-1c"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"                 = "dev-public"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all         = {
          + "Name"                 = "dev-public"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[0] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[1] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.elasticache[2] will be created
  + resource "aws_route_table_association" "elasticache" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[0] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "100.64.0.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-elasticache-us-east-1a"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-elasticache-us-east-1a"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[1] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "100.64.16.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-elasticache-us-east-1b"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-elasticache-us-east-1b"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.elasticache[2] will be created
  + resource "aws_subnet" "elasticache" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "100.64.32.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-elasticache-us-east-1c"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-elasticache-us-east-1c"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_purpose"                     = "Overloaded for k8s worker usage"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-private-us-east-1a"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-private-us-east-1a"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.2.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-private-us-east-1b"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-private-us-east-1b"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.3.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                            = "dev-private-us-east-1c"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                            = "dev-private-us-east-1c"
          + "kubernetes.io/cluster/dev"       = "shared"
          + "kubernetes.io/role/internal-elb" = "1"
          + "ops_env"                         = "dev"
          + "ops_managed_by"                  = "terraform"
          + "ops_owners"                      = "devops"
          + "ops_source_repo"                 = "kubernetes-ops"
          + "ops_source_repo_path"            = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                      = "dev-public-us-east-1a"
          + "kubernetes.io/cluster/dev" = "shared"
          + "kubernetes.io/role/elb"    = "1"
          + "ops_env"                   = "dev"
          + "ops_managed_by"            = "terraform"
          + "ops_owners"                = "devops"
          + "ops_source_repo"           = "kubernetes-ops"
          + "ops_source_repo_path"      = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                      = "dev-public-us-east-1a"
          + "kubernetes.io/cluster/dev" = "shared"
          + "kubernetes.io/role/elb"    = "1"
          + "ops_env"                   = "dev"
          + "ops_managed_by"            = "terraform"
          + "ops_owners"                = "devops"
          + "ops_source_repo"           = "kubernetes-ops"
          + "ops_source_repo_path"      = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.102.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                      = "dev-public-us-east-1b"
          + "kubernetes.io/cluster/dev" = "shared"
          + "kubernetes.io/role/elb"    = "1"
          + "ops_env"                   = "dev"
          + "ops_managed_by"            = "terraform"
          + "ops_owners"                = "devops"
          + "ops_source_repo"           = "kubernetes-ops"
          + "ops_source_repo_path"      = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                      = "dev-public-us-east-1b"
          + "kubernetes.io/cluster/dev" = "shared"
          + "kubernetes.io/role/elb"    = "1"
          + "ops_env"                   = "dev"
          + "ops_managed_by"            = "terraform"
          + "ops_owners"                = "devops"
          + "ops_source_repo"           = "kubernetes-ops"
          + "ops_source_repo_path"      = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1c"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.103.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name"                      = "dev-public-us-east-1c"
          + "kubernetes.io/cluster/dev" = "shared"
          + "kubernetes.io/role/elb"    = "1"
          + "ops_env"                   = "dev"
          + "ops_managed_by"            = "terraform"
          + "ops_owners"                = "devops"
          + "ops_source_repo"           = "kubernetes-ops"
          + "ops_source_repo_path"      = "terraform-environments/aws/dev"
        }
      + tags_all                        = {
          + "Name"                      = "dev-public-us-east-1c"
          + "kubernetes.io/cluster/dev" = "shared"
          + "kubernetes.io/role/elb"    = "1"
          + "ops_env"                   = "dev"
          + "ops_managed_by"            = "terraform"
          + "ops_owners"                = "devops"
          + "ops_source_repo"           = "kubernetes-ops"
          + "ops_source_repo_path"      = "terraform-environments/aws/dev"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = true
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all                         = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
    }

  # module.vpc.module.vpc.aws_vpc_ipv4_cidr_block_association.this[0] will be created
  + resource "aws_vpc_ipv4_cidr_block_association" "this" {
      + cidr_block = "100.64.0.0/16"
      + id         = (known after apply)
      + vpc_id     = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpn_gateway.this[0] will be created
  + resource "aws_vpn_gateway" "this" {
      + amazon_side_asn = "64512"
      + arn             = (known after apply)
      + id              = (known after apply)
      + tags            = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + tags_all        = {
          + "Name"                 = "dev"
          + "ops_env"              = "dev"
          + "ops_managed_by"       = "terraform"
          + "ops_owners"           = "devops"
          + "ops_source_repo"      = "kubernetes-ops"
          + "ops_source_repo_path" = "terraform-environments/aws/dev"
        }
      + vpc_id          = (known after apply)
    }

Plan: 37 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ k8s_subnets     = [
      - "subnet-0657079e1cf654f83",
      - "subnet-04e3f95ed4da8de17",
      - "subnet-0e2482beb9ee577ff",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ private_subnets = [
      - "subnet-0fc573779d8333634",
      - "subnet-0225a5c1f1bbd0398",
      - "subnet-0ba49e0d9b025cdb4",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ public_subnets  = [
      - "subnet-0a60ba528563f06cb",
      - "subnet-0c8e88db02c29e1f2",
      - "subnet-08f49bacf42ea6217",
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ vpc_id          = "vpc-0c098dac6f579d4b0" -> (known after apply)

```


</details>

*Pusher: @sekka1, Action: `pull_request`*